1s/ERP/extensions/liko/DataProcessors/ОбеспечениеПотребностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОбеспечениеПотребностей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказыКОбеспечению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Требуется</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковкаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Обеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>МинимальныйЗапас</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>МаксимальныйЗапас</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказыКПоступлению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>МетодОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыОбеспеченияПотребностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковкаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособыОбеспечения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОбеспеченияПотребностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ОбеспечениеПотребностей/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Лико_ЗаполнитьКонтрагентаПосле(Команда) 
	Контрагент=ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	ОписаниеОповещение=Новый ОписаниеОповещения("ЗаполнениеКонтрагентаЗавершение",ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещение,Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеКонтрагентаЗавершение(Результат,ДопПараметры) Экспорт//+Лико m.shenderov 20.04.2018
	Если Результат<>Неопределено Тогда
		Для каждого СторкаЗапаса Из Элементы.Запасы.ВыделенныеСтроки Цикл
			Запас=Объект.Запасы.НайтиПоИдентификатору(СторкаЗапаса);
			Запас.ИсточникОбеспечения=Результат;
			
		КонецЦикла;
	КонецЕсли;
	
	Лико_РасчитатьЗаказы();	
КонецПроцедуры //-Лико m.shenderov 20.04.2018


&НаСервере
Процедура Лико_СформированныеЗаказыОтметкаПриИзмененииПослеНаСервере()
	Для каждого Заказ Из ТаблицаДокументы Цикл
		Заказ.Отметка=Ложь;
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Лико_СформированныеЗаказыОтметкаПриИзмененииПосле(Элемент)
	Лико_СформированныеЗаказыОтметкаПриИзмененииПослеНаСервере();
	Элементы.СформированныеЗаказы.ТекущиеДанные.Отметка=Истина;
КонецПроцедуры


&НаСервере
Процедура Лико_Лико_СвернутьЗаказыПослеНаСервере()
	ЗаказПриемник=Неопределено;
	Для каждого Заказ Из ТаблицаДокументы Цикл
		Если  Заказ.Отметка=Истина Тогда
			
			ЗаказПриемник=Заказ.Документ;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЗаказПриемник) ТОгда
		Возврат;
	КонецЕсли;
	
	ДокОбъект=ЗаказПриемник.ПолучитьОбъект();
	//ДокОбъект=Документы.ЗаказПоставщику.СоздатьДокумент();
	Для каждого Заказ Из ТаблицаДокументы Цикл
		
		Если Заказ.Отметка=Ложь Тогда
			Для каждого Товар Из Заказ.Документ.Товары Цикл
				
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Товар.Номенклатура);
				Структура.Вставить("Характеристика",Товар.Характеристика);
				НайтиСтроки=ДокОбъект.Товары.НайтиСтроки(Структура);
				Если НайтиСтроки.Количество()>0 Тогда
					
					Строка=НайтиСтроки[0];
					Строка.Количество=Строка.Количество+Товар.Количество;
				Иначе
					Строка= ДокОбъект.Товары.Добавить();
					Строка.Номенклатура=Товар.Номенклатура;
					Строка.Характеристика=Товар.Характеристика; 
					Строка.Количество=Товар.Количество;
					Строка.КоличествоУпаковок=Товар.КоличествоУпаковок;
              		Строка.Цена=Товар.Цена; 
					ЗаполнитьЗначенияСвойств(Строка,Товар);
				КонецЕсли;	
				СтруктураПересчетаСуммы = ДанныеПересчетаСуммыНДСВСтрокеТЧ(ЗаказПриемник);		
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());  		
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
				
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	ДокОбъект.Записать();	
	Структура = Новый Структура;
	Структура.Вставить("Отметка",Ложь);
	НайтиСтроки=ТаблицаДокументы.НайтиСтроки(Структура);
	Для каждого НайденаяСтрока Из НайтиСтроки Цикл
		
		ТаблицаДокументы.Удалить(ТаблицаДокументы.Индекс(НайденаяСтрока));
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_Лико_СвернутьЗаказыПосле(Команда)
	Лико_Лико_СвернутьЗаказыПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ДанныеПересчетаСуммыНДСВСтрокеТЧ(Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураПересчетаСуммы.Вставить("НДСпоСтавкам4и2",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "НДСпоСтавкам4и2"));
	
	Возврат СтруктураПересчетаСуммы;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
	"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
	
КонецФункции
